#  Дан список, содержащий искажённые данные с должностями и именами сотрудников:


# Известно, что имя сотрудника всегда в конце строки. Сформировать и вывести на экран фразы вида: 'Привет, Игорь!' Подумать, как получить имена сотрудников из элементов списка, как привести их к корректному виду. Можно ли при этом не создавать новый список?


lst= ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']

for i in range(len(lst)):
  print('Привет,',(lst[i][(lst[i].rfind(' ')+1):].title()+'!'))

